In [2]:
import numpy as np
import pandas as pd

In [3]:
path1 = "task6_1.csv"
df1 = pd.read_csv(path1)
df1

      id        date goods  sales
0   1001  2019-01-01     A   3000
1   1001  2019-01-01     B   2000
2   1002  2019-01-01     A   3000
3   1003  2019-01-01     B   2000
4   1001  2019-01-02     A   3000
5   1002  2019-01-02     A   3000
6   1002  2019-01-02     B   2000
7   1003  2019-01-02     A   3000
8   1001  2019-01-03     A   3000
9   1002  2019-01-03     B   2000
10  1001  2019-01-04     A   3000
11  1002  2019-01-04     A   3000

In [13]:
pd.pivot_table(df1,index="id",columns="date",values="sales",aggfunc=np.sum)

date  2019-01-01  2019-01-02  2019-01-03  2019-01-04
id
1001      5000.0      3000.0      3000.0      3000.0
1002      3000.0      5000.0      2000.0      3000.0
1003      2000.0      3000.0         NaN         NaN

In [14]:
pd.pivot_table(df1,index="id",columns= "date",values="sales",aggfunc=sum,margins=True)

date  2019-01-01  2019-01-02  2019-01-03  2019-01-04    All
id
1001      5000.0      3000.0      3000.0      3000.0  14000
1002      3000.0      5000.0      2000.0      3000.0  13000
1003      2000.0      3000.0         NaN         NaN   5000
All      10000.0     11000.0      5000.0      6000.0  32000

In [15]:
path2 = "task6_2.csv"
df2 = pd.read_csv(path2)
df2

     sex  age  smoke  height
0    man   15   True     168
1    man   23  False     179
2  women   25  False     181
3  women   17   True     166
4    man   35   True     173
5  women   57  False     178
6    man   24  False     188
7  women   31   True     190
8  women   22  False     160

In [20]:
pd.pivot_table(df2[df2.smoke ==True],index="sex",values=["age","height"])

       age  height
sex
man     25   170.5
women   24   178.0

In [21]:
pd.crosstab(df2.smoke,df2.sex)

sex    man  women
smoke
False    2      3
True     2      2

In [26]:
pd.crosstab(df2.age,df2.smoke)

smoke  False  True
age
15         0      1
17         0      1
22         1      0
23         1      0
24         1      0
25         1      0
31         0      1
35         0      1
57         1      0